a = 60  # 60 = 0011 1100
b = 13  # 13 = 0000 1101
c = 0

c = a & b  # 12 = 0000 1100
print(bin(a), "和", bin(b), "按位与运算的值为：", bin(c), "十进制为", c)

c = a | b  # 61 = 0011 1101
print(bin(a), "和", bin(b), "按位或运算的值为：", bin(c), "十进制为", c)

c = a ^ b  # 49 = 0011 0001
print(bin(a), "和", bin(b), "按位异或运算的值为：", bin(c), "十进制为", c)

c = ~a  # -61 = 1100 0011
print(bin(a), "按位取反运算的值为：", bin(c), "十进制为", c)
print("按位取反等同-a-1的值为", bin(-a - 1), "十进制为", -a-1)

c = a << 2  # 240 = 1111 0000
print(bin(a), "左移动", 2, "位运算的值为：", bin(c), "十进制为", c)

c = a >> 2  # 15 = 0000 1111
print(bin(a), "右移动", 2, "位运算的值为：", bin(c), "十进制为", c)
